data_generation/simulation_results/case_65/constant/simParams
nIter 2000;
hComponent0 1644.6116525219265;
hComponent1 2833.849861523151;
hComponent2 4556.124653338251;
hComponent3 4636.776265760231;
hComponent4 4273.369850015503;kComponent0 72.90909510144641;
kComponent1 18.424981186102983;
kComponent2 19.81748918813426;
kComponent3 73.78443524580543;
kComponent4 21.454473530179538;
tAmbient 300;
Ux 2.569898407794409;
kPCB 0.46825068603788567;